Ran Plan for dir: `live/dev/aws/vpc` workspace: `default`

<details><summary>Show Output</summary>

```diff
10:49:16.442 INFO   Downloading Terraform configurations from file://../../../../modules/aws into ./.terragrunt-cache/B46dxQfE25_MXbjftqLgsQsGA68/OMvEZSgfdNKT3iMSsQI6066tUtw
10:49:16.542 STDOUT terraform: Initializing the backend...
10:49:16.559 STDOUT terraform: Initializing provider plugins...
10:49:16.560 STDOUT terraform: - Finding hashicorp/aws versions matching ">= 4.35.0"...
10:49:17.128 STDOUT terraform: - Installing hashicorp/aws v5.68.0...
10:49:20.919 STDOUT terraform: - Installed hashicorp/aws v5.68.0 (signed by HashiCorp)
10:49:20.919 STDOUT terraform: Terraform has created a lock file .terraform.lock.hcl to record the provider
10:49:20.919 STDOUT terraform: selections it made above. Include this file in your version control repository
10:49:20.919 STDOUT terraform: so that Terraform can guarantee to make the same selections by default when
10:49:20.919 STDOUT terraform: you run "terraform init" in the future.
10:49:20.921 STDOUT terraform: Terraform has been successfully initialized!
10:49:20.921 STDOUT terraform: 
10:49:20.921 STDOUT terraform: You may now begin working with Terraform. Try running "terraform plan" to see
10:49:20.921 STDOUT terraform: any changes that are required for your infrastructure. All Terraform commands
10:49:20.921 STDOUT terraform: should now work.
10:49:20.921 STDOUT terraform: If you ever set or change modules or backend configuration for Terraform,
10:49:20.921 STDOUT terraform: rerun this command to reinitialize your working directory. If you forget, other
10:49:20.921 STDOUT terraform: commands will detect it and remind you to do so if necessary.

10:49:21.069 STDOUT terraform: Initializing the backend...
10:49:21.453 STDOUT terraform: Initializing provider plugins...
10:49:21.453 STDOUT terraform: - Reusing previous version of hashicorp/aws from the dependency lock file
10:49:21.836 STDOUT terraform: - Using previously-installed hashicorp/aws v5.68.0
10:49:21.836 STDOUT terraform: Terraform has been successfully initialized!
10:49:21.836 STDOUT terraform: 
10:49:21.836 STDOUT terraform: You may now begin working with Terraform. Try running "terraform plan" to see
10:49:21.836 STDOUT terraform: any changes that are required for your infrastructure. All Terraform commands
10:49:21.836 STDOUT terraform: should now work.
10:49:21.836 STDOUT terraform: If you ever set or change modules or backend configuration for Terraform,
10:49:21.836 STDOUT terraform: rerun this command to reinitialize your working directory. If you forget, other
10:49:21.836 STDOUT terraform: commands will detect it and remind you to do so if necessary.
10:49:26.556 STDOUT terraform: Terraform used the selected providers to generate the following execution
10:49:26.556 STDOUT terraform: plan. Resource actions are indicated with the following symbols:
10:49:26.556 STDOUT terraform:   + create
10:49:26.556 STDOUT terraform: Terraform will perform the following actions:
10:49:26.557 STDOUT terraform:   # aws_default_network_acl.this[0] will be created
10:49:26.557 STDOUT terraform:   + resource "aws_default_network_acl" "this" {
10:49:26.557 STDOUT terraform:       + arn                    = (known after apply)
10:49:26.557 STDOUT terraform:       + default_network_acl_id = (known after apply)
10:49:26.557 STDOUT terraform:       + id                     = (known after apply)
10:49:26.557 STDOUT terraform:       + owner_id               = (known after apply)
10:49:26.557 STDOUT terraform:       + tags                   = {
10:49:26.557 STDOUT terraform:           + "Environment" = "dev"
10:49:26.557 STDOUT terraform:           + "Name"        = "my-vpc2-default"
10:49:26.557 STDOUT terraform:           + "Terraform"   = "true"
10:49:26.557 STDOUT terraform:         }
10:49:26.557 STDOUT terraform:       + tags_all               = {
10:49:26.557 STDOUT terraform:           + "Environment" = "dev"
10:49:26.557 STDOUT terraform:           + "Name"        = "my-vpc2-default"
10:49:26.557 STDOUT terraform:           + "Terraform"   = "true"
10:49:26.557 STDOUT terraform:         }
10:49:26.557 STDOUT terraform:       + vpc_id                 = (known after apply)
10:49:26.557 STDOUT terraform:       + egress {
10:49:26.557 STDOUT terraform:           + action          = "allow"
10:49:26.557 STDOUT terraform:           + from_port       = 0
10:49:26.557 STDOUT terraform:           + ipv6_cidr_block = "::/0"
10:49:26.557 STDOUT terraform:           + protocol        = "-1"
10:49:26.557 STDOUT terraform:           + rule_no         = 101
10:49:26.557 STDOUT terraform:           + to_port         = 0
10:49:26.557 STDOUT terraform:             # (1 unchanged attribute hidden)
10:49:26.557 STDOUT terraform:         }
10:49:26.557 STDOUT terraform:       + egress {
10:49:26.557 STDOUT terraform:           + action          = "allow"
10:49:26.557 STDOUT terraform:           + cidr_block      = "0.0.0.0/0"
10:49:26.557 STDOUT terraform:           + from_port       = 0
10:49:26.557 STDOUT terraform:           + protocol        = "-1"
10:49:26.557 STDOUT terraform:           + rule_no         = 100
10:49:26.557 STDOUT terraform:           + to_port         = 0
10:49:26.557 STDOUT terraform:             # (1 unchanged attribute hidden)
10:49:26.557 STDOUT terraform:         }
10:49:26.557 STDOUT terraform:       + ingress {
10:49:26.557 STDOUT terraform:           + action          = "allow"
10:49:26.557 STDOUT terraform:           + from_port       = 0
10:49:26.557 STDOUT terraform:           + ipv6_cidr_block = "::/0"
10:49:26.557 STDOUT terraform:           + protocol        = "-1"
10:49:26.557 STDOUT terraform:           + rule_no         = 101
10:49:26.557 STDOUT terraform:           + to_port         = 0
10:49:26.557 STDOUT terraform:             # (1 unchanged attribute hidden)
10:49:26.557 STDOUT terraform:         }
10:49:26.557 STDOUT terraform:       + ingress {
10:49:26.557 STDOUT terraform:           + action          = "allow"
10:49:26.557 STDOUT terraform:           + cidr_block      = "0.0.0.0/0"
10:49:26.557 STDOUT terraform:           + from_port       = 0
10:49:26.557 STDOUT terraform:           + protocol        = "-1"
10:49:26.557 STDOUT terraform:           + rule_no         = 100
10:49:26.557 STDOUT terraform:           + to_port         = 0
10:49:26.557 STDOUT terraform:             # (1 unchanged attribute hidden)
10:49:26.557 STDOUT terraform:         }
10:49:26.557 STDOUT terraform:     }
10:49:26.557 STDOUT terraform:   # aws_default_route_table.default[0] will be created
10:49:26.557 STDOUT terraform:   + resource "aws_default_route_table" "default" {
10:49:26.557 STDOUT terraform:       + arn                    = (known after apply)
10:49:26.557 STDOUT terraform:       + default_route_table_id = (known after apply)
10:49:26.557 STDOUT terraform:       + id                     = (known after apply)
10:49:26.557 STDOUT terraform:       + owner_id               = (known after apply)
10:49:26.557 STDOUT terraform:       + route                  = (known after apply)
10:49:26.557 STDOUT terraform:       + tags                   = {
10:49:26.558 STDOUT terraform:           + "Environment" = "dev"
10:49:26.558 STDOUT terraform:           + "Name"        = "my-vpc2-default"
10:49:26.558 STDOUT terraform:           + "Terraform"   = "true"
10:49:26.558 STDOUT terraform:         }
10:49:26.558 STDOUT terraform:       + tags_all               = {
10:49:26.558 STDOUT terraform:           + "Environment" = "dev"
10:49:26.558 STDOUT terraform:           + "Name"        = "my-vpc2-default"
10:49:26.558 STDOUT terraform:           + "Terraform"   = "true"
10:49:26.558 STDOUT terraform:         }
10:49:26.558 STDOUT terraform:       + vpc_id                 = (known after apply)
10:49:26.558 STDOUT terraform:       + timeouts {
10:49:26.558 STDOUT terraform:           + create = "5m"
10:49:26.558 STDOUT terraform:           + update = "5m"
10:49:26.558 STDOUT terraform:         }
10:49:26.558 STDOUT terraform:     }
10:49:26.558 STDOUT terraform:   # aws_default_security_group.this[0] will be created
10:49:26.558 STDOUT terraform:   + resource "aws_default_security_group" "this" {
10:49:26.558 STDOUT terraform:       + arn                    = (known after apply)
10:49:26.558 STDOUT terraform:       + description            = (known after apply)
10:49:26.558 STDOUT terraform:       + egress                 = (known after apply)
10:49:26.558 STDOUT terraform:       + id                     = (known after apply)
10:49:26.558 STDOUT terraform:       + ingress                = (known after apply)
10:49:26.558 STDOUT terraform:       + name                   = (known after apply)
10:49:26.558 STDOUT terraform:       + name_prefix            = (known after apply)
10:49:26.558 STDOUT terraform:       + owner_id               = (known after apply)
10:49:26.558 STDOUT terraform:       + revoke_rules_on_delete = false
10:49:26.558 STDOUT terraform:       + tags                   = {
10:49:26.558 STDOUT terraform:           + "Environment" = "dev"
10:49:26.558 STDOUT terraform:           + "Name"        = "my-vpc2-default"
10:49:26.558 STDOUT terraform:           + "Terraform"   = "true"
10:49:26.558 STDOUT terraform:         }
10:49:26.558 STDOUT terraform:       + tags_all               = {
10:49:26.558 STDOUT terraform:           + "Environment" = "dev"
10:49:26.558 STDOUT terraform:           + "Name"        = "my-vpc2-default"
10:49:26.558 STDOUT terraform:           + "Terraform"   = "true"
10:49:26.558 STDOUT terraform:         }
10:49:26.558 STDOUT terraform:       + vpc_id                 = (known after apply)
10:49:26.558 STDOUT terraform:     }
10:49:26.558 STDOUT terraform:   # aws_eip.nat[0] will be created
10:49:26.558 STDOUT terraform:   + resource "aws_eip" "nat" {
10:49:26.558 STDOUT terraform:       + allocation_id        = (known after apply)
10:49:26.558 STDOUT terraform:       + arn                  = (known after apply)
10:49:26.558 STDOUT terraform:       + association_id       = (known after apply)
10:49:26.558 STDOUT terraform:       + carrier_ip           = (known after apply)
10:49:26.558 STDOUT terraform:       + customer_owned_ip    = (known after apply)
10:49:26.558 STDOUT terraform:       + domain               = (known after apply)
10:49:26.558 STDOUT terraform:       + id                   = (known after apply)
10:49:26.558 STDOUT terraform:       + instance             = (known after apply)
10:49:26.558 STDOUT terraform:       + network_border_group = (known after apply)
10:49:26.558 STDOUT terraform:       + network_interface    = (known after apply)
10:49:26.558 STDOUT terraform:       + private_dns          = (known after apply)
10:49:26.558 STDOUT terraform:       + private_ip           = (known after apply)
10:49:26.558 STDOUT terraform:       + ptr_record           = (known after apply)
10:49:26.558 STDOUT terraform:       + public_dns           = (known after apply)
10:49:26.558 STDOUT terraform:       + public_ip            = (known after apply)
10:49:26.558 STDOUT terraform:       + public_ipv4_pool     = (known after apply)
10:49:26.558 STDOUT terraform:       + tags                 = {
10:49:26.558 STDOUT terraform:           + "Environment" = "dev"
10:49:26.558 STDOUT terraform:           + "Name"        = "my-vpc2-eu-west-1a"
10:49:26.558 STDOUT terraform:           + "Terraform"   = "true"
10:49:26.558 STDOUT terraform:         }
10:49:26.558 STDOUT terraform:       + tags_all             = {
10:49:26.558 STDOUT terraform:           + "Environment" = "dev"
10:49:26.558 STDOUT terraform:           + "Name"        = "my-vpc2-eu-west-1a"
10:49:26.558 STDOUT terraform:           + "Terraform"   = "true"
10:49:26.558 STDOUT terraform:         }
10:49:26.558 STDOUT terraform:       + vpc                  = true
10:49:26.558 STDOUT terraform:     }
10:49:26.558 STDOUT terraform:   # aws_eip.nat[1] will be created
10:49:26.559 STDOUT terraform:   + resource "aws_eip" "nat" {
10:49:26.559 STDOUT terraform:       + allocation_id        = (known after apply)
10:49:26.559 STDOUT terraform:       + arn                  = (known after apply)
10:49:26.559 STDOUT terraform:       + association_id       = (known after apply)
10:49:26.559 STDOUT terraform:       + carrier_ip           = (known after apply)
10:49:26.559 STDOUT terraform:       + customer_owned_ip    = (known after apply)
10:49:26.559 STDOUT terraform:       + domain               = (known after apply)
10:49:26.559 STDOUT terraform:       + id                   = (known after apply)
10:49:26.559 STDOUT terraform:       + instance             = (known after apply)
10:49:26.559 STDOUT terraform:       + network_border_group = (known after apply)
10:49:26.559 STDOUT terraform:       + network_interface    = (known after apply)
10:49:26.559 STDOUT terraform:       + private_dns          = (known after apply)
10:49:26.559 STDOUT terraform:       + private_ip           = (known after apply)
10:49:26.559 STDOUT terraform:       + ptr_record           = (known after apply)
10:49:26.559 STDOUT terraform:       + public_dns           = (known after apply)
10:49:26.559 STDOUT terraform:       + public_ip            = (known after apply)
10:49:26.559 STDOUT terraform:       + public_ipv4_pool     = (known after apply)
10:49:26.559 STDOUT terraform:       + tags                 = {
10:49:26.559 STDOUT terraform:           + "Environment" = "dev"
10:49:26.559 STDOUT terraform:           + "Name"        = "my-vpc2-eu-west-1b"
10:49:26.559 STDOUT terraform:           + "Terraform"   = "true"
10:49:26.559 STDOUT terraform:         }
10:49:26.559 STDOUT terraform:       + tags_all             = {
10:49:26.559 STDOUT terraform:           + "Environment" = "dev"
10:49:26.559 STDOUT terraform:           + "Name"        = "my-vpc2-eu-west-1b"
10:49:26.559 STDOUT terraform:           + "Terraform"   = "true"
10:49:26.559 STDOUT terraform:         }
10:49:26.559 STDOUT terraform:       + vpc                  = true
10:49:26.559 STDOUT terraform:     }
10:49:26.559 STDOUT terraform:   # aws_eip.nat[2] will be created
10:49:26.559 STDOUT terraform:   + resource "aws_eip" "nat" {
10:49:26.559 STDOUT terraform:       + allocation_id        = (known after apply)
10:49:26.559 STDOUT terraform:       + arn                  = (known after apply)
10:49:26.559 STDOUT terraform:       + association_id       = (known after apply)
10:49:26.559 STDOUT terraform:       + carrier_ip           = (known after apply)
10:49:26.559 STDOUT terraform:       + customer_owned_ip    = (known after apply)
10:49:26.559 STDOUT terraform:       + domain               = (known after apply)
10:49:26.559 STDOUT terraform:       + id                   = (known after apply)
10:49:26.559 STDOUT terraform:       + instance             = (known after apply)
10:49:26.559 STDOUT terraform:       + network_border_group = (known after apply)
10:49:26.559 STDOUT terraform:       + network_interface    = (known after apply)
10:49:26.559 STDOUT terraform:       + private_dns          = (known after apply)
10:49:26.559 STDOUT terraform:       + private_ip           = (known after apply)
10:49:26.559 STDOUT terraform:       + ptr_record           = (known after apply)
10:49:26.559 STDOUT terraform:       + public_dns           = (known after apply)
10:49:26.559 STDOUT terraform:       + public_ip            = (known after apply)
10:49:26.559 STDOUT terraform:       + public_ipv4_pool     = (known after apply)
10:49:26.559 STDOUT terraform:       + tags                 = {
10:49:26.559 STDOUT terraform:           + "Environment" = "dev"
10:49:26.559 STDOUT terraform:           + "Name"        = "my-vpc2-eu-west-1c"
10:49:26.559 STDOUT terraform:           + "Terraform"   = "true"
10:49:26.559 STDOUT terraform:         }
10:49:26.559 STDOUT terraform:       + tags_all             = {
10:49:26.559 STDOUT terraform:           + "Environment" = "dev"
10:49:26.559 STDOUT terraform:           + "Name"        = "my-vpc2-eu-west-1c"
10:49:26.559 STDOUT terraform:           + "Terraform"   = "true"
10:49:26.559 STDOUT terraform:         }
10:49:26.559 STDOUT terraform:       + vpc                  = true
10:49:26.559 STDOUT terraform:     }
10:49:26.559 STDOUT terraform:   # aws_internet_gateway.this[0] will be created
10:49:26.559 STDOUT terraform:   + resource "aws_internet_gateway" "this" {
10:49:26.559 STDOUT terraform:       + arn      = (known after apply)
10:49:26.559 STDOUT terraform:       + id       = (known after apply)
10:49:26.559 STDOUT terraform:       + owner_id = (known after apply)
10:49:26.559 STDOUT terraform:       + tags     = {
10:49:26.559 STDOUT terraform:           + "Environment" = "dev"
10:49:26.559 STDOUT terraform:           + "Name"        = "my-vpc2"
10:49:26.559 STDOUT terraform:           + "Terraform"   = "true"
10:49:26.559 STDOUT terraform:         }
10:49:26.559 STDOUT terraform:       + tags_all = {
10:49:26.559 STDOUT terraform:           + "Environment" = "dev"
10:49:26.560 STDOUT terraform:           + "Name"        = "my-vpc2"
10:49:26.560 STDOUT terraform:           + "Terraform"   = "true"
10:49:26.560 STDOUT terraform:         }
10:49:26.560 STDOUT terraform:       + vpc_id   = (known after apply)
10:49:26.560 STDOUT terraform:     }
10:49:26.560 STDOUT terraform:   # aws_nat_gateway.this[0] will be created
10:49:26.560 STDOUT terraform:   + resource "aws_nat_gateway" "this" {
10:49:26.560 STDOUT terraform:       + allocation_id                      = (known after apply)
10:49:26.560 STDOUT terraform:       + association_id                     = (known after apply)
10:49:26.560 STDOUT terraform:       + connectivity_type                  = "public"
10:49:26.560 STDOUT terraform:       + id                                 = (known after apply)
10:49:26.560 STDOUT terraform:       + network_interface_id               = (known after apply)
10:49:26.560 STDOUT terraform:       + private_ip                         = (known after apply)
10:49:26.560 STDOUT terraform:       + public_ip                          = (known after apply)
10:49:26.560 STDOUT terraform:       + secondary_private_ip_address_count = (known after apply)
10:49:26.560 STDOUT terraform:       + secondary_private_ip_addresses     = (known after apply)
10:49:26.560 STDOUT terraform:       + subnet_id                          = (known after apply)
10:49:26.560 STDOUT terraform:       + tags                               = {
10:49:26.560 STDOUT terraform:           + "Environment" = "dev"
10:49:26.560 STDOUT terraform:           + "Name"        = "my-vpc2-eu-west-1a"
10:49:26.560 STDOUT terraform:           + "Terraform"   = "true"
10:49:26.560 STDOUT terraform:         }
10:49:26.560 STDOUT terraform:       + tags_all                           = {
10:49:26.560 STDOUT terraform:           + "Environment" = "dev"
10:49:26.560 STDOUT terraform:           + "Name"        = "my-vpc2-eu-west-1a"
10:49:26.560 STDOUT terraform:           + "Terraform"   = "true"
10:49:26.560 STDOUT terraform:         }
10:49:26.560 STDOUT terraform:     }
10:49:26.560 STDOUT terraform:   # aws_nat_gateway.this[1] will be created
10:49:26.560 STDOUT terraform:   + resource "aws_nat_gateway" "this" {
10:49:26.560 STDOUT terraform:       + allocation_id                      = (known after apply)
10:49:26.560 STDOUT terraform:       + association_id                     = (known after apply)
10:49:26.560 STDOUT terraform:       + connectivity_type                  = "public"
10:49:26.560 STDOUT terraform:       + id                                 = (known after apply)
10:49:26.560 STDOUT terraform:       + network_interface_id               = (known after apply)
10:49:26.560 STDOUT terraform:       + private_ip                         = (known after apply)
10:49:26.560 STDOUT terraform:       + public_ip                          = (known after apply)
10:49:26.560 STDOUT terraform:       + secondary_private_ip_address_count = (known after apply)
10:49:26.560 STDOUT terraform:       + secondary_private_ip_addresses     = (known after apply)
10:49:26.560 STDOUT terraform:       + subnet_id                          = (known after apply)
10:49:26.560 STDOUT terraform:       + tags                               = {
10:49:26.560 STDOUT terraform:           + "Environment" = "dev"
10:49:26.560 STDOUT terraform:           + "Name"        = "my-vpc2-eu-west-1b"
10:49:26.560 STDOUT terraform:           + "Terraform"   = "true"
10:49:26.560 STDOUT terraform:         }
10:49:26.560 STDOUT terraform:       + tags_all                           = {
10:49:26.560 STDOUT terraform:           + "Environment" = "dev"
10:49:26.560 STDOUT terraform:           + "Name"        = "my-vpc2-eu-west-1b"
10:49:26.560 STDOUT terraform:           + "Terraform"   = "true"
10:49:26.560 STDOUT terraform:         }
10:49:26.560 STDOUT terraform:     }
10:49:26.560 STDOUT terraform:   # aws_nat_gateway.this[2] will be created
10:49:26.560 STDOUT terraform:   + resource "aws_nat_gateway" "this" {
10:49:26.560 STDOUT terraform:       + allocation_id                      = (known after apply)
10:49:26.560 STDOUT terraform:       + association_id                     = (known after apply)
10:49:26.560 STDOUT terraform:       + connectivity_type                  = "public"
10:49:26.560 STDOUT terraform:       + id                                 = (known after apply)
10:49:26.560 STDOUT terraform:       + network_interface_id               = (known after apply)
10:49:26.560 STDOUT terraform:       + private_ip                         = (known after apply)
10:49:26.560 STDOUT terraform:       + public_ip                          = (known after apply)
10:49:26.560 STDOUT terraform:       + secondary_private_ip_address_count = (known after apply)
10:49:26.560 STDOUT terraform:       + secondary_private_ip_addresses     = (known after apply)
10:49:26.560 STDOUT terraform:       + subnet_id                          = (known after apply)
10:49:26.560 STDOUT terraform:       + tags                               = {
10:49:26.560 STDOUT terraform:           + "Environment" = "dev"
10:49:26.560 STDOUT terraform:           + "Name"        = "my-vpc2-eu-west-1c"
10:49:26.560 STDOUT terraform:           + "Terraform"   = "true"
10:49:26.560 STDOUT terraform:         }
10:49:26.560 STDOUT terraform:       + tags_all                           = {
10:49:26.560 STDOUT terraform:           + "Environment" = "dev"
10:49:26.561 STDOUT terraform:           + "Name"        = "my-vpc2-eu-west-1c"
10:49:26.561 STDOUT terraform:           + "Terraform"   = "true"
10:49:26.561 STDOUT terraform:         }
10:49:26.561 STDOUT terraform:     }
10:49:26.561 STDOUT terraform:   # aws_route.private_nat_gateway[0] will be created
10:49:26.561 STDOUT terraform:   + resource "aws_route" "private_nat_gateway" {
10:49:26.561 STDOUT terraform:       + destination_cidr_block = "0.0.0.0/0"
10:49:26.561 STDOUT terraform:       + id                     = (known after apply)
10:49:26.561 STDOUT terraform:       + instance_id            = (known after apply)
10:49:26.561 STDOUT terraform:       + instance_owner_id      = (known after apply)
10:49:26.561 STDOUT terraform:       + nat_gateway_id         = (known after apply)
10:49:26.561 STDOUT terraform:       + network_interface_id   = (known after apply)
10:49:26.561 STDOUT terraform:       + origin                 = (known after apply)
10:49:26.561 STDOUT terraform:       + route_table_id         = (known after apply)
10:49:26.561 STDOUT terraform:       + state                  = (known after apply)
10:49:26.561 STDOUT terraform:       + timeouts {
10:49:26.561 STDOUT terraform:           + create = "5m"
10:49:26.561 STDOUT terraform:         }
10:49:26.561 STDOUT terraform:     }
10:49:26.561 STDOUT terraform:   # aws_route.private_nat_gateway[1] will be created
10:49:26.561 STDOUT terraform:   + resource "aws_route" "private_nat_gateway" {
10:49:26.561 STDOUT terraform:       + destination_cidr_block = "0.0.0.0/0"
10:49:26.561 STDOUT terraform:       + id                     = (known after apply)
10:49:26.561 STDOUT terraform:       + instance_id            = (known after apply)
10:49:26.561 STDOUT terraform:       + instance_owner_id      = (known after apply)
10:49:26.561 STDOUT terraform:       + nat_gateway_id         = (known after apply)
10:49:26.561 STDOUT terraform:       + network_interface_id   = (known after apply)
10:49:26.561 STDOUT terraform:       + origin                 = (known after apply)
10:49:26.561 STDOUT terraform:       + route_table_id         = (known after apply)
10:49:26.561 STDOUT terraform:       + state                  = (known after apply)
10:49:26.561 STDOUT terraform:       + timeouts {
10:49:26.561 STDOUT terraform:           + create = "5m"
10:49:26.561 STDOUT terraform:         }
10:49:26.561 STDOUT terraform:     }
10:49:26.561 STDOUT terraform:   # aws_route.private_nat_gateway[2] will be created
10:49:26.561 STDOUT terraform:   + resource "aws_route" "private_nat_gateway" {
10:49:26.561 STDOUT terraform:       + destination_cidr_block = "0.0.0.0/0"
10:49:26.561 STDOUT terraform:       + id                     = (known after apply)
10:49:26.561 STDOUT terraform:       + instance_id            = (known after apply)
10:49:26.561 STDOUT terraform:       + instance_owner_id      = (known after apply)
10:49:26.561 STDOUT terraform:       + nat_gateway_id         = (known after apply)
10:49:26.561 STDOUT terraform:       + network_interface_id   = (known after apply)
10:49:26.561 STDOUT terraform:       + origin                 = (known after apply)
10:49:26.561 STDOUT terraform:       + route_table_id         = (known after apply)
10:49:26.561 STDOUT terraform:       + state                  = (known after apply)
10:49:26.561 STDOUT terraform:       + timeouts {
10:49:26.561 STDOUT terraform:           + create = "5m"
10:49:26.561 STDOUT terraform:         }
10:49:26.561 STDOUT terraform:     }
10:49:26.561 STDOUT terraform:   # aws_route.public_internet_gateway[0] will be created
10:49:26.561 STDOUT terraform:   + resource "aws_route" "public_internet_gateway" {
10:49:26.561 STDOUT terraform:       + destination_cidr_block = "0.0.0.0/0"
10:49:26.561 STDOUT terraform:       + gateway_id             = (known after apply)
10:49:26.561 STDOUT terraform:       + id                     = (known after apply)
10:49:26.561 STDOUT terraform:       + instance_id            = (known after apply)
10:49:26.561 STDOUT terraform:       + instance_owner_id      = (known after apply)
10:49:26.561 STDOUT terraform:       + network_interface_id   = (known after apply)
10:49:26.561 STDOUT terraform:       + origin                 = (known after apply)
10:49:26.561 STDOUT terraform:       + route_table_id         = (known after apply)
10:49:26.561 STDOUT terraform:       + state                  = (known after apply)
10:49:26.561 STDOUT terraform:       + timeouts {
10:49:26.561 STDOUT terraform:           + create = "5m"
10:49:26.561 STDOUT terraform:         }
10:49:26.561 STDOUT terraform:     }
10:49:26.561 STDOUT terraform:   # aws_route_table.private[0] will be created
10:49:26.561 STDOUT terraform:   + resource "aws_route_table" "private" {
10:49:26.561 STDOUT terraform:       + arn              = (known after apply)
10:49:26.561 STDOUT terraform:       + id               = (known after apply)
10:49:26.561 STDOUT terraform:       + owner_id         = (known after apply)
10:49:26.561 STDOUT terraform:       + propagating_vgws = (known after apply)
10:49:26.561 STDOUT terraform:       + route            = (known after apply)
10:49:26.561 STDOUT terraform:       + tags             = {
10:49:26.562 STDOUT terraform:           + "Environment" = "dev"
10:49:26.562 STDOUT terraform:           + "Name"        = "my-vpc2-private-eu-west-1a"
10:49:26.562 STDOUT terraform:           + "Terraform"   = "true"
10:49:26.562 STDOUT terraform:         }
10:49:26.562 STDOUT terraform:       + tags_all         = {
10:49:26.562 STDOUT terraform:           + "Environment" = "dev"
10:49:26.562 STDOUT terraform:           + "Name"        = "my-vpc2-private-eu-west-1a"
10:49:26.562 STDOUT terraform:           + "Terraform"   = "true"
10:49:26.562 STDOUT terraform:         }
10:49:26.562 STDOUT terraform:       + vpc_id           = (known after apply)
10:49:26.562 STDOUT terraform:     }
10:49:26.562 STDOUT terraform:   # aws_route_table.private[1] will be created
10:49:26.562 STDOUT terraform:   + resource "aws_route_table" "private" {
10:49:26.562 STDOUT terraform:       + arn              = (known after apply)
10:49:26.562 STDOUT terraform:       + id               = (known after apply)
10:49:26.562 STDOUT terraform:       + owner_id         = (known after apply)
10:49:26.562 STDOUT terraform:       + propagating_vgws = (known after apply)
10:49:26.562 STDOUT terraform:       + route            = (known after apply)
10:49:26.562 STDOUT terraform:       + tags             = {
10:49:26.562 STDOUT terraform:           + "Environment" = "dev"
10:49:26.562 STDOUT terraform:           + "Name"        = "my-vpc2-private-eu-west-1b"
10:49:26.562 STDOUT terraform:           + "Terraform"   = "true"
10:49:26.562 STDOUT terraform:         }
10:49:26.562 STDOUT terraform:       + tags_all         = {
10:49:26.562 STDOUT terraform:           + "Environment" = "dev"
10:49:26.562 STDOUT terraform:           + "Name"        = "my-vpc2-private-eu-west-1b"
10:49:26.562 STDOUT terraform:           + "Terraform"   = "true"
10:49:26.562 STDOUT terraform:         }
10:49:26.562 STDOUT terraform:       + vpc_id           = (known after apply)
10:49:26.562 STDOUT terraform:     }
10:49:26.562 STDOUT terraform:   # aws_route_table.private[2] will be created
10:49:26.562 STDOUT terraform:   + resource "aws_route_table" "private" {
10:49:26.562 STDOUT terraform:       + arn              = (known after apply)
10:49:26.562 STDOUT terraform:       + id               = (known after apply)
10:49:26.562 STDOUT terraform:       + owner_id         = (known after apply)
10:49:26.562 STDOUT terraform:       + propagating_vgws = (known after apply)
10:49:26.562 STDOUT terraform:       + route            = (known after apply)
10:49:26.562 STDOUT terraform:       + tags             = {
10:49:26.562 STDOUT terraform:           + "Environment" = "dev"
10:49:26.562 STDOUT terraform:           + "Name"        = "my-vpc2-private-eu-west-1c"
10:49:26.562 STDOUT terraform:           + "Terraform"   = "true"
10:49:26.562 STDOUT terraform:         }
10:49:26.562 STDOUT terraform:       + tags_all         = {
10:49:26.562 STDOUT terraform:           + "Environment" = "dev"
10:49:26.562 STDOUT terraform:           + "Name"        = "my-vpc2-private-eu-west-1c"
10:49:26.562 STDOUT terraform:           + "Terraform"   = "true"
10:49:26.562 STDOUT terraform:         }
10:49:26.562 STDOUT terraform:       + vpc_id           = (known after apply)
10:49:26.562 STDOUT terraform:     }
10:49:26.562 STDOUT terraform:   # aws_route_table.public[0] will be created
10:49:26.562 STDOUT terraform:   + resource "aws_route_table" "public" {
10:49:26.562 STDOUT terraform:       + arn              = (known after apply)
10:49:26.562 STDOUT terraform:       + id               = (known after apply)
10:49:26.562 STDOUT terraform:       + owner_id         = (known after apply)
10:49:26.562 STDOUT terraform:       + propagating_vgws = (known after apply)
10:49:26.562 STDOUT terraform:       + route            = (known after apply)
10:49:26.562 STDOUT terraform:       + tags             = {
10:49:26.562 STDOUT terraform:           + "Environment" = "dev"
10:49:26.562 STDOUT terraform:           + "Name"        = "my-vpc2-public"
10:49:26.562 STDOUT terraform:           + "Terraform"   = "true"
10:49:26.562 STDOUT terraform:         }
10:49:26.562 STDOUT terraform:       + tags_all         = {
10:49:26.562 STDOUT terraform:           + "Environment" = "dev"
10:49:26.562 STDOUT terraform:           + "Name"        = "my-vpc2-public"
10:49:26.562 STDOUT terraform:           + "Terraform"   = "true"
10:49:26.562 STDOUT terraform:         }
10:49:26.562 STDOUT terraform:       + vpc_id           = (known after apply)
10:49:26.562 STDOUT terraform:     }
10:49:26.562 STDOUT terraform:   # aws_route_table_association.private[0] will be created
10:49:26.563 STDOUT terraform:   + resource "aws_route_table_association" "private" {
10:49:26.563 STDOUT terraform:       + id             = (known after apply)
10:49:26.563 STDOUT terraform:       + route_table_id = (known after apply)
10:49:26.563 STDOUT terraform:       + subnet_id      = (known after apply)
10:49:26.563 STDOUT terraform:     }
10:49:26.563 STDOUT terraform:   # aws_route_table_association.private[1] will be created
10:49:26.563 STDOUT terraform:   + resource "aws_route_table_association" "private" {
10:49:26.563 STDOUT terraform:       + id             = (known after apply)
10:49:26.563 STDOUT terraform:       + route_table_id = (known after apply)
10:49:26.563 STDOUT terraform:       + subnet_id      = (known after apply)
10:49:26.563 STDOUT terraform:     }
10:49:26.563 STDOUT terraform:   # aws_route_table_association.private[2] will be created
10:49:26.563 STDOUT terraform:   + resource "aws_route_table_association" "private" {
10:49:26.563 STDOUT terraform:       + id             = (known after apply)
10:49:26.563 STDOUT terraform:       + route_table_id = (known after apply)
10:49:26.563 STDOUT terraform:       + subnet_id      = (known after apply)
10:49:26.563 STDOUT terraform:     }
10:49:26.563 STDOUT terraform:   # aws_route_table_association.public[0] will be created
10:49:26.563 STDOUT terraform:   + resource "aws_route_table_association" "public" {
10:49:26.563 STDOUT terraform:       + id             = (known after apply)
10:49:26.563 STDOUT terraform:       + route_table_id = (known after apply)
10:49:26.563 STDOUT terraform:       + subnet_id      = (known after apply)
10:49:26.563 STDOUT terraform:     }
10:49:26.563 STDOUT terraform:   # aws_route_table_association.public[1] will be created
10:49:26.563 STDOUT terraform:   + resource "aws_route_table_association" "public" {
10:49:26.563 STDOUT terraform:       + id             = (known after apply)
10:49:26.563 STDOUT terraform:       + route_table_id = (known after apply)
10:49:26.563 STDOUT terraform:       + subnet_id      = (known after apply)
10:49:26.563 STDOUT terraform:     }
10:49:26.563 STDOUT terraform:   # aws_route_table_association.public[2] will be created
10:49:26.563 STDOUT terraform:   + resource "aws_route_table_association" "public" {
10:49:26.563 STDOUT terraform:       + id             = (known after apply)
10:49:26.563 STDOUT terraform:       + route_table_id = (known after apply)
10:49:26.563 STDOUT terraform:       + subnet_id      = (known after apply)
10:49:26.563 STDOUT terraform:     }
10:49:26.563 STDOUT terraform:   # aws_subnet.private[0] will be created
10:49:26.563 STDOUT terraform:   + resource "aws_subnet" "private" {
10:49:26.563 STDOUT terraform:       + arn                                            = (known after apply)
10:49:26.563 STDOUT terraform:       + assign_ipv6_address_on_creation                = false
10:49:26.563 STDOUT terraform:       + availability_zone                              = "eu-west-1a"
10:49:26.563 STDOUT terraform:       + availability_zone_id                           = (known after apply)
10:49:26.563 STDOUT terraform:       + cidr_block                                     = "10.0.1.0/24"
10:49:26.563 STDOUT terraform:       + enable_dns64                                   = false
10:49:26.563 STDOUT terraform:       + enable_resource_name_dns_a_record_on_launch    = false
10:49:26.563 STDOUT terraform:       + enable_resource_name_dns_aaaa_record_on_launch = false
10:49:26.563 STDOUT terraform:       + id                                             = (known after apply)
10:49:26.563 STDOUT terraform:       + ipv6_cidr_block_association_id                 = (known after apply)
10:49:26.563 STDOUT terraform:       + ipv6_native                                    = false
10:49:26.563 STDOUT terraform:       + map_public_ip_on_launch                        = false
10:49:26.563 STDOUT terraform:       + owner_id                                       = (known after apply)
10:49:26.563 STDOUT terraform:       + private_dns_hostname_type_on_launch            = (known after apply)
10:49:26.563 STDOUT terraform:       + tags                                           = {
10:49:26.563 STDOUT terraform:           + "Environment" = "dev"
10:49:26.563 STDOUT terraform:           + "Name"        = "my-vpc2-private-eu-west-1a"
10:49:26.563 STDOUT terraform:           + "Terraform"   = "true"
10:49:26.563 STDOUT terraform:         }
10:49:26.563 STDOUT terraform:       + tags_all                                       = {
10:49:26.563 STDOUT terraform:           + "Environment" = "dev"
10:49:26.563 STDOUT terraform:           + "Name"        = "my-vpc2-private-eu-west-1a"
10:49:26.563 STDOUT terraform:           + "Terraform"   = "true"
10:49:26.563 STDOUT terraform:         }
10:49:26.563 STDOUT terraform:       + vpc_id                                         = (known after apply)
10:49:26.563 STDOUT terraform:     }
10:49:26.563 STDOUT terraform:   # aws_subnet.private[1] will be created
10:49:26.563 STDOUT terraform:   + resource "aws_subnet" "private" {
10:49:26.563 STDOUT terraform:       + arn                                            = (known after apply)
10:49:26.563 STDOUT terraform:       + assign_ipv6_address_on_creation                = false
10:49:26.563 STDOUT terraform:       + availability_zone                              = "eu-west-1b"
10:49:26.563 STDOUT terraform:       + availability_zone_id                           = (known after apply)
10:49:26.563 STDOUT terraform:       + cidr_block                                     = "10.0.2.0/24"
10:49:26.563 STDOUT terraform:       + enable_dns64                                   = false
10:49:26.563 STDOUT terraform:       + enable_resource_name_dns_a_record_on_launch    = false
10:49:26.564 STDOUT terraform:       + enable_resource_name_dns_aaaa_record_on_launch = false
10:49:26.564 STDOUT terraform:       + id                                             = (known after apply)
10:49:26.564 STDOUT terraform:       + ipv6_cidr_block_association_id                 = (known after apply)
10:49:26.564 STDOUT terraform:       + ipv6_native                                    = false
10:49:26.564 STDOUT terraform:       + map_public_ip_on_launch                        = false
10:49:26.564 STDOUT terraform:       + owner_id                                       = (known after apply)
10:49:26.564 STDOUT terraform:       + private_dns_hostname_type_on_launch            = (known after apply)
10:49:26.564 STDOUT terraform:       + tags                                           = {
10:49:26.564 STDOUT terraform:           + "Environment" = "dev"
10:49:26.564 STDOUT terraform:           + "Name"        = "my-vpc2-private-eu-west-1b"
10:49:26.564 STDOUT terraform:           + "Terraform"   = "true"
10:49:26.564 STDOUT terraform:         }
10:49:26.564 STDOUT terraform:       + tags_all                                       = {
10:49:26.564 STDOUT terraform:           + "Environment" = "dev"
10:49:26.564 STDOUT terraform:           + "Name"        = "my-vpc2-private-eu-west-1b"
10:49:26.564 STDOUT terraform:           + "Terraform"   = "true"
10:49:26.564 STDOUT terraform:         }
10:49:26.564 STDOUT terraform:       + vpc_id                                         = (known after apply)
10:49:26.564 STDOUT terraform:     }
10:49:26.564 STDOUT terraform:   # aws_subnet.private[2] will be created
10:49:26.564 STDOUT terraform:   + resource "aws_subnet" "private" {
10:49:26.564 STDOUT terraform:       + arn                                            = (known after apply)
10:49:26.564 STDOUT terraform:       + assign_ipv6_address_on_creation                = false
10:49:26.564 STDOUT terraform:       + availability_zone                              = "eu-west-1c"
10:49:26.564 STDOUT terraform:       + availability_zone_id                           = (known after apply)
10:49:26.564 STDOUT terraform:       + cidr_block                                     = "10.0.3.0/24"
10:49:26.564 STDOUT terraform:       + enable_dns64                                   = false
10:49:26.564 STDOUT terraform:       + enable_resource_name_dns_a_record_on_launch    = false
10:49:26.564 STDOUT terraform:       + enable_resource_name_dns_aaaa_record_on_launch = false
10:49:26.564 STDOUT terraform:       + id                                             = (known after apply)
10:49:26.564 STDOUT terraform:       + ipv6_cidr_block_association_id                 = (known after apply)
10:49:26.564 STDOUT terraform:       + ipv6_native                                    = false
10:49:26.564 STDOUT terraform:       + map_public_ip_on_launch                        = false
10:49:26.564 STDOUT terraform:       + owner_id                                       = (known after apply)
10:49:26.564 STDOUT terraform:       + private_dns_hostname_type_on_launch            = (known after apply)
10:49:26.564 STDOUT terraform:       + tags                                           = {
10:49:26.564 STDOUT terraform:           + "Environment" = "dev"
10:49:26.564 STDOUT terraform:           + "Name"        = "my-vpc2-private-eu-west-1c"
10:49:26.564 STDOUT terraform:           + "Terraform"   = "true"
10:49:26.564 STDOUT terraform:         }
10:49:26.564 STDOUT terraform:       + tags_all                                       = {
10:49:26.564 STDOUT terraform:           + "Environment" = "dev"
10:49:26.564 STDOUT terraform:           + "Name"        = "my-vpc2-private-eu-west-1c"
10:49:26.564 STDOUT terraform:           + "Terraform"   = "true"
10:49:26.564 STDOUT terraform:         }
10:49:26.564 STDOUT terraform:       + vpc_id                                         = (known after apply)
10:49:26.564 STDOUT terraform:     }
10:49:26.564 STDOUT terraform:   # aws_subnet.public[0] will be created
10:49:26.564 STDOUT terraform:   + resource "aws_subnet" "public" {
10:49:26.564 STDOUT terraform:       + arn                                            = (known after apply)
10:49:26.564 STDOUT terraform:       + assign_ipv6_address_on_creation                = false
10:49:26.564 STDOUT terraform:       + availability_zone                              = "eu-west-1a"
10:49:26.564 STDOUT terraform:       + availability_zone_id                           = (known after apply)
10:49:26.564 STDOUT terraform:       + cidr_block                                     = "10.0.101.0/24"
10:49:26.564 STDOUT terraform:       + enable_dns64                                   = false
10:49:26.564 STDOUT terraform:       + enable_resource_name_dns_a_record_on_launch    = false
10:49:26.564 STDOUT terraform:       + enable_resource_name_dns_aaaa_record_on_launch = false
10:49:26.564 STDOUT terraform:       + id                                             = (known after apply)
10:49:26.564 STDOUT terraform:       + ipv6_cidr_block_association_id                 = (known after apply)
10:49:26.564 STDOUT terraform:       + ipv6_native                                    = false
10:49:26.564 STDOUT terraform:       + map_public_ip_on_launch                        = false
10:49:26.564 STDOUT terraform:       + owner_id                                       = (known after apply)
10:49:26.564 STDOUT terraform:       + private_dns_hostname_type_on_launch            = (known after apply)
10:49:26.564 STDOUT terraform:       + tags                                           = {
10:49:26.564 STDOUT terraform:           + "Environment" = "dev"
10:49:26.564 STDOUT terraform:           + "Name"        = "my-vpc2-public-eu-west-1a"
10:49:26.564 STDOUT terraform:           + "Terraform"   = "true"
10:49:26.564 STDOUT terraform:         }
10:49:26.564 STDOUT terraform:       + tags_all                                       = {
10:49:26.564 STDOUT terraform:           + "Environment" = "dev"
10:49:26.564 STDOUT terraform:           + "Name"        = "my-vpc2-public-eu-west-1a"
10:49:26.565 STDOUT terraform:           + "Terraform"   = "true"
10:49:26.565 STDOUT terraform:         }
10:49:26.565 STDOUT terraform:       + vpc_id                                         = (known after apply)
10:49:26.565 STDOUT terraform:     }
10:49:26.565 STDOUT terraform:   # aws_subnet.public[1] will be created
10:49:26.565 STDOUT terraform:   + resource "aws_subnet" "public" {
10:49:26.565 STDOUT terraform:       + arn                                            = (known after apply)
10:49:26.565 STDOUT terraform:       + assign_ipv6_address_on_creation                = false
10:49:26.565 STDOUT terraform:       + availability_zone                              = "eu-west-1b"
10:49:26.565 STDOUT terraform:       + availability_zone_id                           = (known after apply)
10:49:26.565 STDOUT terraform:       + cidr_block                                     = "10.0.102.0/24"
10:49:26.565 STDOUT terraform:       + enable_dns64                                   = false
10:49:26.565 STDOUT terraform:       + enable_resource_name_dns_a_record_on_launch    = false
10:49:26.565 STDOUT terraform:       + enable_resource_name_dns_aaaa_record_on_launch = false
10:49:26.565 STDOUT terraform:       + id                                             = (known after apply)
10:49:26.565 STDOUT terraform:       + ipv6_cidr_block_association_id                 = (known after apply)
10:49:26.565 STDOUT terraform:       + ipv6_native                                    = false
10:49:26.565 STDOUT terraform:       + map_public_ip_on_launch                        = false
10:49:26.565 STDOUT terraform:       + owner_id                                       = (known after apply)
10:49:26.565 STDOUT terraform:       + private_dns_hostname_type_on_launch            = (known after apply)
10:49:26.565 STDOUT terraform:       + tags                                           = {
10:49:26.565 STDOUT terraform:           + "Environment" = "dev"
10:49:26.565 STDOUT terraform:           + "Name"        = "my-vpc2-public-eu-west-1b"
10:49:26.565 STDOUT terraform:           + "Terraform"   = "true"
10:49:26.565 STDOUT terraform:         }
10:49:26.566 STDOUT terraform:       + tags_all                                       = {
10:49:26.566 STDOUT terraform:           + "Environment" = "dev"
10:49:26.566 STDOUT terraform:           + "Name"        = "my-vpc2-public-eu-west-1b"
10:49:26.566 STDOUT terraform:           + "Terraform"   = "true"
10:49:26.566 STDOUT terraform:         }
10:49:26.566 STDOUT terraform:       + vpc_id                                         = (known after apply)
10:49:26.566 STDOUT terraform:     }
10:49:26.566 STDOUT terraform:   # aws_subnet.public[2] will be created
10:49:26.566 STDOUT terraform:   + resource "aws_subnet" "public" {
10:49:26.566 STDOUT terraform:       + arn                                            = (known after apply)
10:49:26.566 STDOUT terraform:       + assign_ipv6_address_on_creation                = false
10:49:26.566 STDOUT terraform:       + availability_zone                              = "eu-west-1c"
10:49:26.566 STDOUT terraform:       + availability_zone_id                           = (known after apply)
10:49:26.566 STDOUT terraform:       + cidr_block                                     = "10.0.103.0/24"
10:49:26.566 STDOUT terraform:       + enable_dns64                                   = false
10:49:26.566 STDOUT terraform:       + enable_resource_name_dns_a_record_on_launch    = false
10:49:26.566 STDOUT terraform:       + enable_resource_name_dns_aaaa_record_on_launch = false
10:49:26.566 STDOUT terraform:       + id                                             = (known after apply)
10:49:26.566 STDOUT terraform:       + ipv6_cidr_block_association_id                 = (known after apply)
10:49:26.566 STDOUT terraform:       + ipv6_native                                    = false
10:49:26.566 STDOUT terraform:       + map_public_ip_on_launch                        = false
10:49:26.566 STDOUT terraform:       + owner_id                                       = (known after apply)
10:49:26.566 STDOUT terraform:       + private_dns_hostname_type_on_launch            = (known after apply)
10:49:26.566 STDOUT terraform:       + tags                                           = {
10:49:26.566 STDOUT terraform:           + "Environment" = "dev"
10:49:26.566 STDOUT terraform:           + "Name"        = "my-vpc2-public-eu-west-1c"
10:49:26.566 STDOUT terraform:           + "Terraform"   = "true"
10:49:26.566 STDOUT terraform:         }
10:49:26.566 STDOUT terraform:       + tags_all                                       = {
10:49:26.566 STDOUT terraform:           + "Environment" = "dev"
10:49:26.566 STDOUT terraform:           + "Name"        = "my-vpc2-public-eu-west-1c"
10:49:26.566 STDOUT terraform:           + "Terraform"   = "true"
10:49:26.567 STDOUT terraform:         }
10:49:26.567 STDOUT terraform:       + vpc_id                                         = (known after apply)
10:49:26.567 STDOUT terraform:     }
10:49:26.567 STDOUT terraform:   # aws_vpc.this[0] will be created
10:49:26.567 STDOUT terraform:   + resource "aws_vpc" "this" {
10:49:26.567 STDOUT terraform:       + arn                                  = (known after apply)
10:49:26.567 STDOUT terraform:       + cidr_block                           = "10.0.0.0/16"
10:49:26.567 STDOUT terraform:       + default_network_acl_id               = (known after apply)
10:49:26.567 STDOUT terraform:       + default_route_table_id               = (known after apply)
10:49:26.567 STDOUT terraform:       + default_security_group_id            = (known after apply)
10:49:26.567 STDOUT terraform:       + dhcp_options_id                      = (known after apply)
10:49:26.567 STDOUT terraform:       + enable_dns_hostnames                 = true
10:49:26.567 STDOUT terraform:       + enable_dns_support                   = true
10:49:26.567 STDOUT terraform:       + enable_network_address_usage_metrics = (known after apply)
10:49:26.567 STDOUT terraform:       + id                                   = (known after apply)
10:49:26.567 STDOUT terraform:       + instance_tenancy                     = "default"
10:49:26.567 STDOUT terraform:       + ipv6_association_id                  = (known after apply)
10:49:26.567 STDOUT terraform:       + ipv6_cidr_block                      = (known after apply)
10:49:26.567 STDOUT terraform:       + ipv6_cidr_block_network_border_group = (known after apply)
10:49:26.567 STDOUT terraform:       + main_route_table_id                  = (known after apply)
10:49:26.567 STDOUT terraform:       + owner_id                             = (known after apply)
10:49:26.567 STDOUT terraform:       + tags                                 = {
10:49:26.567 STDOUT terraform:           + "Environment" = "dev"
10:49:26.567 STDOUT terraform:           + "Name"        = "my-vpc2"
10:49:26.567 STDOUT terraform:           + "Terraform"   = "true"
10:49:26.567 STDOUT terraform:         }
10:49:26.567 STDOUT terraform:       + tags_all                             = {
10:49:26.567 STDOUT terraform:           + "Environment" = "dev"
10:49:26.567 STDOUT terraform:           + "Name"        = "my-vpc2"
10:49:26.567 STDOUT terraform:           + "Terraform"   = "true"
10:49:26.568 STDOUT terraform:         }
10:49:26.568 STDOUT terraform:     }
10:49:26.568 STDOUT terraform:   # aws_vpn_gateway.this[0] will be created
10:49:26.568 STDOUT terraform:   + resource "aws_vpn_gateway" "this" {
10:49:26.568 STDOUT terraform:       + amazon_side_asn = "64512"
10:49:26.568 STDOUT terraform:       + arn             = (known after apply)
10:49:26.568 STDOUT terraform:       + id              = (known after apply)
10:49:26.568 STDOUT terraform:       + tags            = {
10:49:26.568 STDOUT terraform:           + "Environment" = "dev"
10:49:26.568 STDOUT terraform:           + "Name"        = "my-vpc2"
10:49:26.568 STDOUT terraform:           + "Terraform"   = "true"
10:49:26.568 STDOUT terraform:         }
10:49:26.568 STDOUT terraform:       + tags_all        = {
10:49:26.568 STDOUT terraform:           + "Environment" = "dev"
10:49:26.568 STDOUT terraform:           + "Name"        = "my-vpc2"
10:49:26.568 STDOUT terraform:           + "Terraform"   = "true"
10:49:26.568 STDOUT terraform:         }
10:49:26.568 STDOUT terraform:       + vpc_id          = (known after apply)
10:49:26.568 STDOUT terraform:     }
10:49:26.568 STDOUT terraform: Plan: 32 to add, 0 to change, 0 to destroy.
10:49:26.568 STDOUT terraform: 
10:49:26.568 STDOUT terraform: Changes to Outputs:
10:49:26.568 STDOUT terraform:   + azs                                         = [
10:49:26.568 STDOUT terraform:       + "eu-west-1a",
10:49:26.568 STDOUT terraform:       + "eu-west-1b",
10:49:26.568 STDOUT terraform:       + "eu-west-1c",
10:49:26.568 STDOUT terraform:     ]
10:49:26.568 STDOUT terraform:   + cgw_arns                                    = []
10:49:26.568 STDOUT terraform:   + cgw_ids                                     = []
10:49:26.568 STDOUT terraform:   + database_nat_gateway_route_ids              = []
10:49:26.568 STDOUT terraform:   + database_route_table_association_ids        = []
10:49:26.568 STDOUT terraform:   + database_route_table_ids                    = (known after apply)
10:49:26.568 STDOUT terraform:   + database_subnet_arns                        = []
10:49:26.568 STDOUT terraform:   + database_subnets                            = []
10:49:26.568 STDOUT terraform:   + database_subnets_cidr_blocks                = []
10:49:26.568 STDOUT terraform:   + database_subnets_ipv6_cidr_blocks           = []
10:49:26.568 STDOUT terraform:   + default_network_acl_id                      = (known after apply)
10:49:26.568 STDOUT terraform:   + default_route_table_id                      = (known after apply)
10:49:26.568 STDOUT terraform:   + default_security_group_id                   = (known after apply)
10:49:26.568 STDOUT terraform:   + elasticache_route_table_association_ids     = []
10:49:26.568 STDOUT terraform:   + elasticache_route_table_ids                 = (known after apply)
10:49:26.568 STDOUT terraform:   + elasticache_subnet_arns                     = []
10:49:26.568 STDOUT terraform:   + elasticache_subnets                         = []
10:49:26.568 STDOUT terraform:   + elasticache_subnets_cidr_blocks             = []
10:49:26.568 STDOUT terraform:   + elasticache_subnets_ipv6_cidr_blocks        = []
10:49:26.568 STDOUT terraform:   + igw_arn                                     = (known after apply)
10:49:26.568 STDOUT terraform:   + igw_id                                      = (known after apply)
10:49:26.568 STDOUT terraform:   + intra_route_table_association_ids           = []
10:49:26.568 STDOUT terraform:   + intra_route_table_ids                       = []
10:49:26.568 STDOUT terraform:   + intra_subnet_arns                           = []
10:49:26.568 STDOUT terraform:   + intra_subnets                               = []
10:49:26.568 STDOUT terraform:   + intra_subnets_cidr_blocks                   = []
10:49:26.568 STDOUT terraform:   + intra_subnets_ipv6_cidr_blocks              = []
10:49:26.568 STDOUT terraform:   + name                                        = "my-vpc2"
10:49:26.568 STDOUT terraform:   + nat_ids                                     = [
10:49:26.569 STDOUT terraform:       + (known after apply),
10:49:26.569 STDOUT terraform:       + (known after apply),
10:49:26.569 STDOUT terraform:       + (known after apply),
10:49:26.569 STDOUT terraform:     ]
10:49:26.569 STDOUT terraform:   + nat_public_ips                              = [
10:49:26.569 STDOUT terraform:       + (known after apply),
10:49:26.569 STDOUT terraform:       + (known after apply),
10:49:26.569 STDOUT terraform:       + (known after apply),
10:49:26.569 STDOUT terraform:     ]
10:49:26.569 STDOUT terraform:   + natgw_ids                                   = [
10:49:26.569 STDOUT terraform:       + (known after apply),
10:49:26.569 STDOUT terraform:       + (known after apply),
10:49:26.569 STDOUT terraform:       + (known after apply),
10:49:26.569 STDOUT terraform:     ]
10:49:26.569 STDOUT terraform:   + outpost_subnet_arns                         = []
10:49:26.569 STDOUT terraform:   + outpost_subnets                             = []
10:49:26.569 STDOUT terraform:   + outpost_subnets_cidr_blocks                 = []
10:49:26.569 STDOUT terraform:   + outpost_subnets_ipv6_cidr_blocks            = []
10:49:26.569 STDOUT terraform:   + private_ipv6_egress_route_ids               = []
10:49:26.569 STDOUT terraform:   + private_nat_gateway_route_ids               = [
10:49:26.569 STDOUT terraform:       + (known after apply),
10:49:26.569 STDOUT terraform:       + (known after apply),
10:49:26.569 STDOUT terraform:       + (known after apply),
10:49:26.569 STDOUT terraform:     ]
10:49:26.569 STDOUT terraform:   + private_route_table_association_ids         = [
10:49:26.569 STDOUT terraform:       + (known after apply),
10:49:26.569 STDOUT terraform:       + (known after apply),
10:49:26.569 STDOUT terraform:       + (known after apply),
10:49:26.569 STDOUT terraform:     ]
10:49:26.569 STDOUT terraform:   + private_route_table_ids                     = [
10:49:26.569 STDOUT terraform:       + (known after apply),
10:49:26.569 STDOUT terraform:       + (known after apply),
10:49:26.569 STDOUT terraform:       + (known after apply),
10:49:26.570 STDOUT terraform:     ]
10:49:26.570 STDOUT terraform:   + private_subnet_arns                         = [
10:49:26.570 STDOUT terraform:       + (known after apply),
10:49:26.570 STDOUT terraform:       + (known after apply),
10:49:26.570 STDOUT terraform:       + (known after apply),
10:49:26.570 STDOUT terraform:     ]
10:49:26.570 STDOUT terraform:   + private_subnets                             = [
10:49:26.570 STDOUT terraform:       + (known after apply),
10:49:26.570 STDOUT terraform:       + (known after apply),
10:49:26.570 STDOUT terraform:       + (known after apply),
10:49:26.570 STDOUT terraform:     ]
10:49:26.570 STDOUT terraform:   + private_subnets_cidr_blocks                 = [
10:49:26.570 STDOUT terraform:       + "10.0.1.0/24",
10:49:26.570 STDOUT terraform:       + "10.0.2.0/24",
10:49:26.570 STDOUT terraform:       + "10.0.3.0/24",
10:49:26.570 STDOUT terraform:     ]
10:49:26.570 STDOUT terraform:   + private_subnets_ipv6_cidr_blocks            = []
10:49:26.570 STDOUT terraform:   + public_internet_gateway_route_id            = (known after apply)
10:49:26.570 STDOUT terraform:   + public_route_table_association_ids          = [
10:49:26.570 STDOUT terraform:       + (known after apply),
10:49:26.570 STDOUT terraform:       + (known after apply),
10:49:26.570 STDOUT terraform:       + (known after apply),
10:49:26.570 STDOUT terraform:     ]
10:49:26.570 STDOUT terraform:   + public_route_table_ids                      = [
10:49:26.570 STDOUT terraform:       + (known after apply),
10:49:26.570 STDOUT terraform:     ]
10:49:26.570 STDOUT terraform:   + public_subnet_arns                          = [
10:49:26.570 STDOUT terraform:       + (known after apply),
10:49:26.570 STDOUT terraform:       + (known after apply),
10:49:26.570 STDOUT terraform:       + (known after apply),
10:49:26.570 STDOUT terraform:     ]
10:49:26.570 STDOUT terraform:   + public_subnets                              = [
10:49:26.570 STDOUT terraform:       + (known after apply),
10:49:26.570 STDOUT terraform:       + (known after apply),
10:49:26.570 STDOUT terraform:       + (known after apply),
10:49:26.570 STDOUT terraform:     ]
10:49:26.570 STDOUT terraform:   + public_subnets_cidr_blocks                  = [
10:49:26.570 STDOUT terraform:       + "10.0.101.0/24",
10:49:26.570 STDOUT terraform:       + "10.0.102.0/24",
10:49:26.570 STDOUT terraform:       + "10.0.103.0/24",
10:49:26.570 STDOUT terraform:     ]
10:49:26.570 STDOUT terraform:   + public_subnets_ipv6_cidr_blocks             = []
10:49:26.570 STDOUT terraform:   + redshift_public_route_table_association_ids = []
10:49:26.570 STDOUT terraform:   + redshift_route_table_association_ids        = []
10:49:26.570 STDOUT terraform:   + redshift_route_table_ids                    = [
10:49:26.570 STDOUT terraform:       + (known after apply),
10:49:26.570 STDOUT terraform:       + (known after apply),
10:49:26.570 STDOUT terraform:       + (known after apply),
10:49:26.570 STDOUT terraform:     ]
10:49:26.570 STDOUT terraform:   + redshift_subnet_arns                        = []
10:49:26.570 STDOUT terraform:   + redshift_subnets                            = []
10:49:26.570 STDOUT terraform:   + redshift_subnets_cidr_blocks                = []
10:49:26.570 STDOUT terraform:   + redshift_subnets_ipv6_cidr_blocks           = []
10:49:26.570 STDOUT terraform:   + this_customer_gateway                       = {}
10:49:26.570 STDOUT terraform:   + vgw_arn                                     = (known after apply)
10:49:26.570 STDOUT terraform:   + vgw_id                                      = (known after apply)
10:49:26.570 STDOUT terraform:   + vpc_arn                                     = (known after apply)
10:49:26.570 STDOUT terraform:   + vpc_cidr_block                              = "10.0.0.0/16"
10:49:26.570 STDOUT terraform:   + vpc_enable_dns_hostnames                    = true
10:49:26.570 STDOUT terraform:   + vpc_enable_dns_support                      = true
10:49:26.570 STDOUT terraform:   + vpc_flow_log_cloudwatch_iam_role_arn        = ""
10:49:26.570 STDOUT terraform:   + vpc_flow_log_destination_arn                = ""
10:49:26.570 STDOUT terraform:   + vpc_flow_log_destination_type               = "cloud-watch-logs"
10:49:26.571 STDOUT terraform:   + vpc_id                                      = (known after apply)
10:49:26.571 STDOUT terraform:   + vpc_instance_tenancy                        = "default"
10:49:26.571 STDOUT terraform:   + vpc_ipv6_association_id                     = (known after apply)
10:49:26.571 STDOUT terraform:   + vpc_ipv6_cidr_block                         = (known after apply)
10:49:26.571 STDOUT terraform:   + vpc_main_route_table_id                     = (known after apply)
10:49:26.571 STDOUT terraform:   + vpc_owner_id                                = (known after apply)
10:49:26.571 STDOUT terraform:   + vpc_secondary_cidr_blocks                   = []
10:49:26.577 STDOUT terraform: ╷
10:49:26.577 STDOUT terraform: │ Warning: Argument is deprecated
10:49:26.577 STDOUT terraform: │ 
10:49:26.577 STDOUT terraform: │   with aws_eip.nat,
10:49:26.577 STDOUT terraform: │   on main.tf line 1044, in resource "aws_eip" "nat":
10:49:26.577 STDOUT terraform: │ 1044:   vpc = true
10:49:26.577 STDOUT terraform: │ 
10:49:26.577 STDOUT terraform: │ use domain attribute instead
10:49:26.577 STDOUT terraform: │ 
10:49:26.577 STDOUT terraform: │ (and 3 more similar warnings elsewhere)
10:49:26.577 STDOUT terraform: ╵
10:49:26.577 STDOUT terraform: 
10:49:26.577 STDOUT terraform: ─────────────────────────────────────────────────────────────────────────────
10:49:26.577 STDOUT terraform: Note: You didn't use the -out option to save this plan, so Terraform can't
10:49:26.577 STDOUT terraform: guarantee to take exactly these actions if you run "terraform apply" now.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d live/dev/aws/vpc`
* :put_litter_in_its_place: To **delete** this plan click [here](https://f900-129-150-39-240.ngrok-free.app/lock?id=dinhdobathi1992%252Fterragrunt-multi-cloud%252Flive%252Fdev%252Faws%252Fvpc%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d live/dev/aws/vpc`
</details>
Plan: 32 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To **delete** all plans and locks for the PR, comment:
    * `atlantis unlock`